In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\Vanshika Garg\Desktop\sales_data_sample.csv", encoding="latin1")

In [3]:
print(df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]

# EXPLORING DATA

''' 
df.head()          # First 5 rows
df.tail()          # Last 5 rows
df.shape           # (rows, columns)
df.columns         # List of column names
df.info()          # Column info, non-null counts
df.describe()      # Summary stats for numeric columns
df.dtypes          # Data types of each column
'''

In [4]:
print(df.head(10))

   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0        10107               30      95.70                2  2871.00
1        10121               34      81.35                5  2765.90
2        10134               41      94.74                2  3884.34
3        10145               45      83.26                6  3746.70
4        10159               49     100.00               14  5205.27
5        10168               36      96.66                1  3479.76
6        10180               29      86.13                9  2497.77
7        10188               48     100.00                1  5512.32
8        10201               22      98.57                2  2168.54
9        10211               41     100.00               14  4708.44

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0   2/24/2003 0:00  Shipped       1         2     2003  ...
1    5/7/2003 0:00  Shipped       2         5     2003  ...
2    7/1/2003 0:00  Shipped       3         7     2003  ...
3   8/25/2003 0:00  Shipped       3         8     2003  ...
4  10/10/2003 0:00  Shipped       4        10     2003  ...
5  10/28/2003 0:00  Shipped       4        10     2003  ...
6  11/11/2003 0:00  Shipped       4        11     2003  ...
7  11/18/2003 0:00  Shipped       4        11     2003  ...
8   12/1/2003 0:00  Shipped       4        12     2003  ...
9   1/15/2004 0:00  Shipped       1         1     2004  ...

                    ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0        897 Long Airport Avenue           NaN            NYC    NY
1             59 rue de l'Abbaye           NaN          Reims   NaN
2  27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3             78934 Hillside Dr.           NaN       Pasadena    CA
4                7734 Strong St.           NaN  San Francisco    CA
5              9408 Furth Circle           NaN     Burlingame    CA
6        184, chausse de Tournai           NaN          Lille   NaN
7    Drammen 121, PR 744 Sentrum           NaN         Bergen   NaN
8      5557 North Pendale Street           NaN  San Francisco    CA
9              25, rue Lauriston           NaN          Paris   NaN

  POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0      10022     USA       NaN              Yu             Kwai    Small
1      51100  France      EMEA         Henriot             Paul    Small
2      75508  France      EMEA        Da Cunha           Daniel   Medium
3      90003     USA       NaN           Young            Julie   Medium
4        NaN     USA       NaN           Brown            Julie   Medium
5      94217     USA       NaN          Hirano             Juri   Medium
6      59000  France      EMEA           Rance          Martine    Small
7     N 5804  Norway      EMEA          Oeztan           Veysel   Medium
8        NaN     USA       NaN          Murphy            Julie    Small
9      75016  France      EMEA         Perrier        Dominique   Medium

[10 rows x 25 columns]

In [5]:
print(df.tail(10))

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
2813        10293               32      60.06                1  1921.92
2814        10306               35      59.51                6  2082.85
2815        10315               40      55.69                5  2227.60
2816        10327               37      86.74                4  3209.38
2817        10337               42      97.16                5  4080.72
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
2813    9/9/2004 0:00   Shipped       3         9     2004  ...
2814  10/14/2004 0:00   Shipped       4        10     2004  ...
2815  10/29/2004 0:00   Shipped       4        10     2004  ...
2816  11/10/2004 0:00  Resolved       4        11     2004  ...
2817  11/21/2004 0:00   Shipped       4        11     2004  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                      ADDRESSLINE1  ADDRESSLINE2        CITY STATE POSTALCODE  \
2813           Via Monte Bianco 34           NaN      Torino   NaN      10100
2814             Fauntleroy Circus           NaN  Manchester   NaN    EC2 5NT
2815  67, rue des Cinquante Otages           NaN      Nantes   NaN      44000
2816                  Vinb'ltet 34           NaN   Kobenhavn   NaN       1734
2817              5905 Pompton St.     Suite 750         NYC    NY      10022
2818            C/ Moralzarzal, 86           NaN      Madrid   NaN      28034
2819                   Torikatu 38           NaN        Oulu   NaN      90110
2820            C/ Moralzarzal, 86           NaN      Madrid   NaN      28034
2821         1 rue Alsace-Lorraine           NaN    Toulouse   NaN      31000
2822            8616 Spinnaker Dr.           NaN      Boston    MA      51003

      COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
2813    Italy      EMEA         Accorti            Paolo    Small
2814       UK      EMEA        Ashworth         Victoria    Small
2815   France      EMEA         Labrune           Janine    Small
2816  Denmark      EMEA        Petersen            Jytte   Medium
2817      USA       NaN       Hernandez            Maria   Medium
2818    Spain      EMEA          Freyre            Diego    Small
2819  Finland      EMEA       Koskitalo           Pirkko   Medium
2820    Spain      EMEA          Freyre            Diego   Medium
2821   France      EMEA          Roulet          Annette    Small
2822      USA       NaN         Yoshido             Juri   Medium

[10 rows x 25 columns]

In [6]:
data = {
    "Name":['Ram','sam',None,'Tam','kim','shim'],
    "Age":[14,16,15,23,None,45],
    "Roll No." :[1,4,None,6,2,6],
    "salary":[20000,23000,12000,None,34000,45000]
}

In [7]:
df=pd.DataFrame(data)

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       5 non-null      float64
 2   Roll No.  5 non-null      float64
 3   salary    5 non-null      float64
dtypes: float64(3), object(1)
memory usage: 324.0+ bytes
None

In [9]:
print(df)

   Name   Age  Roll No.   salary
0   Ram  14.0       1.0  20000.0
1   sam  16.0       4.0  23000.0
2  None  15.0       NaN  12000.0
3   Tam  23.0       6.0      NaN
4   kim   NaN       2.0  34000.0
5  shim  45.0       6.0  45000.0

In [10]:
print(df.describe())

             Age  Roll No.        salary
count   5.000000  5.000000      5.000000
mean   22.600000  3.800000  26800.000000
std    13.011533  2.280351  12872.451204
min    14.000000  1.000000  12000.000000
25%    15.000000  2.000000  20000.000000
50%    16.000000  4.000000  23000.000000
75%    23.000000  6.000000  34000.000000
max    45.000000  6.000000  45000.000000

In [11]:
print(df.shape)

(6, 4)

In [12]:
print(df.columns)

Index(['Name', 'Age', 'Roll No.', 'salary'], dtype='object')

# CLEANING DATA

'''
df.isnull().sum()             # Count missing values
df.dropna()                   # Drop rows with NaN
df.fillna(0)                  # Replace NaN with 0
df['col'].replace('?', np.nan)  # Replace bad values

df['col'] = df['col'].astype(int)   # Change data type
df.columns = df.columns.str.strip() # Remove extra spaces in col names
'''

In [13]:
print(df[["Name","Age"]])

   Name   Age
0   Ram  14.0
1   sam  16.0
2  None  15.0
3   Tam  23.0
4   kim   NaN
5  shim  45.0

In [14]:
print(df[(df["salary"]>10000) & (df["Age"]>15)])

   Name   Age  Roll No.   salary
1   sam  16.0       4.0  23000.0
5  shim  45.0       6.0  45000.0

In [15]:
df["bonus"]=df["salary"] * 0.1

In [16]:
print(df)

   Name   Age  Roll No.   salary   bonus
0   Ram  14.0       1.0  20000.0  2000.0
1   sam  16.0       4.0  23000.0  2300.0
2  None  15.0       NaN  12000.0  1200.0
3   Tam  23.0       6.0      NaN     NaN
4   kim   NaN       2.0  34000.0  3400.0
5  shim  45.0       6.0  45000.0  4500.0

In [17]:
df.loc[3,"salary"]=15000

In [18]:
print(df)

   Name   Age  Roll No.   salary   bonus
0   Ram  14.0       1.0  20000.0  2000.0
1   sam  16.0       4.0  23000.0  2300.0
2  None  15.0       NaN  12000.0  1200.0
3   Tam  23.0       6.0  15000.0     NaN
4   kim   NaN       2.0  34000.0  3400.0
5  shim  45.0       6.0  45000.0  4500.0

In [19]:
df.drop(columns=["Age"],inplace=True)
print(df)

   Name  Roll No.   salary   bonus
0   Ram       1.0  20000.0  2000.0
1   sam       4.0  23000.0  2300.0
2  None       NaN  12000.0  1200.0
3   Tam       6.0  15000.0     NaN
4   kim       2.0  34000.0  3400.0
5  shim       6.0  45000.0  4500.0

In [20]:
df.fillna(0, inplace=True)

In [21]:
print(df)

   Name  Roll No.   salary   bonus
0   Ram       1.0  20000.0  2000.0
1   sam       4.0  23000.0  2300.0
2     0       0.0  12000.0  1200.0
3   Tam       6.0  15000.0     0.0
4   kim       2.0  34000.0  3400.0
5  shim       6.0  45000.0  4500.0

In [22]:
df["Name"]=df['Name'].replace(0,"simmy")
print(df)

    Name  Roll No.   salary   bonus
0    Ram       1.0  20000.0  2000.0
1    sam       4.0  23000.0  2300.0
2  simmy       0.0  12000.0  1200.0
3    Tam       6.0  15000.0     0.0
4    kim       2.0  34000.0  3400.0
5   shim       6.0  45000.0  4500.0

In [23]:
grouped=df.groupby("Roll No.")["salary"].sum()
print(grouped)

Roll No.
0.0    12000.0
1.0    20000.0
2.0    34000.0
4.0    23000.0
6.0    60000.0
Name: salary, dtype: float64

In [24]:
information ={
    "TIME": [1,2,3,4],
    "VALUE":[10,20,None,45]
}

In [25]:
df=pd.DataFrame(information)

In [26]:
df["VALUE"]=df["VALUE"].interpolate(method="linear")
print(df)

   TIME  VALUE
0     1   10.0
1     2   20.0
2     3   32.5
3     4   45.0

In [27]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# DataFrame 2
df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Score': [85, 90, 88]
})

In [28]:
merged=pd.merge(df1,df2,on='ID',how='inner')
print(merged)

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [29]:

df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [3, 4], 'Name': ['Charlie', 'David']})

result = pd.concat([df1, df2], axis=0,ignore_index=True)
print(result)
#ignore_index=true : returns continuos index
#axis=1 : coloumn wise concat

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

# Filtering / Selecting Data
'''
df['col']                  # Single column
df[['col1', 'col2']]       # Multiple columns

df[df['col'] > 10]         # Filter by condition
df[(df['A'] > 5) & (df['B'] < 10)]   # Multiple conditions

df.iloc[0:5]               # First 5 rows by position
df.loc[:, ['Name', 'Age']] # Select by label
'''

# Aggregations & Grouping

'''
df['Salary'].sum()
df['Salary'].mean()
df.groupby('Department').mean()
df.groupby(['Dept', 'Gender'])['Salary'].sum()
'''